Revit 2024 API
Transform1D.TransformParameterDomain Method
 Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public IList<double> TransformParameterDomain(
	double domainStart,
	double domainEnd
)
Visual Basic
Public Function TransformParameterDomain ( _
	domainStart As Double, _
	domainEnd As Double _
) As IList(Of Double)
Visual C++
public:
IList<double>^ TransformParameterDomain(
	double domainStart,
	double domainEnd
)
Parameters
domainStart
Type: System.Double
 The original parameter domain start.
domainEnd
Type: System.Double
 The original parameter domain end.
Remarks
 If the domain is empty it is unchanged.
See Also
Transform1D Class
Autodesk.Revit.DB Namespace